# St7GetBrickOutlineMode

Returns where outlines are drawn around bricks.

long St7GetBrickOutlineMode(long uID, long* Mode)

Input Parameters

uID

Strand7 model file ID.

Output Parameters

Mode

One of omEdge, omPropertyBoundary, omGroupBoundary, omFacetAngle, omFacetProperty or
omFacetGroup.